
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.Автор,
		|	ПрисоединенныеФайлы.ДатаСоздания,
		|	ПрисоединенныеФайлы.Описание,
		|	ПрисоединенныеФайлы.Размер
		|ИЗ
		|	РегистрСведений.ПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|ГДЕ
		|	ПрисоединенныеФайлы.ДатаСоздания МЕЖДУ &НачалоДня И &КонецДня";
	
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	
КонецПроцедуры

#КонецОбласти  // ОбработчикиСобытийФормы


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Команда12");
	СделатьРаботу1();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеФункции

&НаСервере
Процедура СделатьРаботу1()
	
	//Пустая строка для гита
	
КонецПроцедуры

#КонецОбласти
