#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Выборка всех контрагентов с инн равным нашей организации
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Контрагенты.Ссылка КАК Контрагент
//	               |ИЗ
//	               |	Справочник.Контрагенты КАК Контрагенты
//	               |ГДЕ
//	               |	Контрагенты.ИНН = &ИНН";
//	
//	Запрос.УстановитьПараметр("ИНН", ИНН);
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ДокументОбъект = Документы.Расш1_Документ1.СоздатьДокумент();
//		ДокументОбъект.Дата = ТекущаяДатаСеанса();
//		ДокументОбъект.Контрагент = Выборка.Контрагент;
//		
//		ДокументОбъект.Записать();
//		
//	КонецЦикла;
	
	ХорошаяПроцедура(Новый Структура("Выбран", Ложь));
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


// Хорошая процедура.
// 
// Параметры:
//  Параметры - Структура:
// * Выбран - Булево. 
// * ДопПараметры - Строка - некая строка.
// 
// Возвращаемое значение:
//  Булево, Неопределено - Это что?
Функция ХорошаяПроцедура(Параметры)
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Хорошая процедура");
	
	Если Параметры.Выбран Тогда
		Параметры.ДопПараметры = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
